# GetFilesInFolder

## Description
Returns the Nth filename in a folder.

```pascal
FUNCTION GetFilesInFolder(
				folderName : STRING;
				index      : INTEGER): STRING;
```

```python
def vs.GetFilesInFolder(folderName, index):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|folderName|STRING|   |
|index|INTEGER|   |

## Examples
[[Python Sample Import Images as Symbols]] for example.

## Version
Availability: from Vectorworks 2014

## Category
* File I@O